Klipper3d/klipper/lib/asf/sam/utils/cmsis/sams70/include/sams70q21.h
/**
 * \file
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAMS70Q21_
#define _SAMS70Q21_

/** \addtogroup SAMS70Q21_definitions SAMS70Q21 definitions
  This file defines all structures and symbols for SAMS70Q21:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMS70Q21 */
/* ************************************************************************** */
/** \addtogroup SAMS70Q21_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M7 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M7 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M7 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M7 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M7 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M7 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M7 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M7 System Tick Interrupt       */
/******  SAMS70Q21 specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAMS70Q21 Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAMS70Q21 Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAMS70Q21 Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAMS70Q21 Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAMS70Q21 Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAMS70Q21 Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAMS70Q21 Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  7, /**<  7 SAMS70Q21 UART 0 (UART0) */
  UART1_IRQn           =  8, /**<  8 SAMS70Q21 UART 1 (UART1) */
  PIOA_IRQn            = 10, /**< 10 SAMS70Q21 Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 11, /**< 11 SAMS70Q21 Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 12, /**< 12 SAMS70Q21 Parallel I/O Controller C (PIOC) */
  USART0_IRQn          = 13, /**< 13 SAMS70Q21 USART 0 (USART0) */
  USART1_IRQn          = 14, /**< 14 SAMS70Q21 USART 1 (USART1) */
  USART2_IRQn          = 15, /**< 15 SAMS70Q21 USART 2 (USART2) */
  PIOD_IRQn            = 16, /**< 16 SAMS70Q21 Parallel I/O Controller D (PIOD) */
  PIOE_IRQn            = 17, /**< 17 SAMS70Q21 Parallel I/O Controller E (PIOE) */
  HSMCI_IRQn           = 18, /**< 18 SAMS70Q21 Multimedia Card Interface (HSMCI) */
  TWIHS0_IRQn          = 19, /**< 19 SAMS70Q21 Two Wire Interface 0 HS (TWIHS0) */
  TWIHS1_IRQn          = 20, /**< 20 SAMS70Q21 Two Wire Interface 1 HS (TWIHS1) */
  SPI0_IRQn            = 21, /**< 21 SAMS70Q21 Serial Peripheral Interface 0 (SPI0) */
  SSC_IRQn             = 22, /**< 22 SAMS70Q21 Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 23, /**< 23 SAMS70Q21 Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAMS70Q21 Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAMS70Q21 Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAMS70Q21 Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAMS70Q21 Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAMS70Q21 Timer/Counter 5 (TC5) */
  AFEC0_IRQn           = 29, /**< 29 SAMS70Q21 Analog Front End 0 (AFEC0) */
  DACC_IRQn            = 30, /**< 30 SAMS70Q21 Digital To Analog Converter (DACC) */
  PWM0_IRQn            = 31, /**< 31 SAMS70Q21 Pulse Width Modulation 0 (PWM0) */
  ICM_IRQn             = 32, /**< 32 SAMS70Q21 Integrity Check Monitor (ICM) */
  ACC_IRQn             = 33, /**< 33 SAMS70Q21 Analog Comparator (ACC) */
  USBHS_IRQn           = 34, /**< 34 SAMS70Q21 USB Host / Device Controller (USBHS) */
  AFEC1_IRQn           = 40, /**< 40 SAMS70Q21 Analog Front End 1 (AFEC1) */
  TWIHS2_IRQn          = 41, /**< 41 SAMS70Q21 Two Wire Interface 2 HS (TWIHS2) */
  SPI1_IRQn            = 42, /**< 42 SAMS70Q21 Serial Peripheral Interface 1 (SPI1) */
  QSPI_IRQn            = 43, /**< 43 SAMS70Q21 Quad I/O Serial Peripheral Interface (QSPI) */
  UART2_IRQn           = 44, /**< 44 SAMS70Q21 UART 2 (UART2) */
  UART3_IRQn           = 45, /**< 45 SAMS70Q21 UART 3 (UART3) */
  UART4_IRQn           = 46, /**< 46 SAMS70Q21 UART 4 (UART4) */
  TC6_IRQn             = 47, /**< 47 SAMS70Q21 Timer/Counter 6 (TC6) */
  TC7_IRQn             = 48, /**< 48 SAMS70Q21 Timer/Counter 7 (TC7) */
  TC8_IRQn             = 49, /**< 49 SAMS70Q21 Timer/Counter 8 (TC8) */
  TC9_IRQn             = 50, /**< 50 SAMS70Q21 Timer/Counter 9 (TC9) */
  TC10_IRQn            = 51, /**< 51 SAMS70Q21 Timer/Counter 10 (TC10) */
  TC11_IRQn            = 52, /**< 52 SAMS70Q21 Timer/Counter 11 (TC11) */
  AES_IRQn             = 56, /**< 56 SAMS70Q21 AES (AES) */
  TRNG_IRQn            = 57, /**< 57 SAMS70Q21 True Random Generator (TRNG) */
  XDMAC_IRQn           = 58, /**< 58 SAMS70Q21 DMA (XDMAC) */
  ISI_IRQn             = 59, /**< 59 SAMS70Q21 Camera Interface (ISI) */
  PWM1_IRQn            = 60, /**< 60 SAMS70Q21 Pulse Width Modulation 1 (PWM1) */
  FPU_IRQn             = 61, /**< 61 SAMS70Q21 Floating Point Unit Registers (FPU) */
  SDRAMC_IRQn          = 62, /**< 62 SAMS70Q21 SDRAM Controller (SDRAMC) */
  RSWDT_IRQn           = 63, /**< 63 SAMS70Q21 Reinforced Safety Watchdog Timer (RSWDT) */
  CCW_IRQn             = 64, /**< 64 SAMS70Q21 System Control Registers (SystemControl) */
  CCF_IRQn             = 65, /**< 65 SAMS70Q21 System Control Registers (SystemControl) */
  IXC_IRQn             = 68, /**< 68 SAMS70Q21 Floating Point Unit Registers (FPU) */

  PERIPH_COUNT_IRQn    = 71  /**< Number of peripheral IDs */
} IRQn_Type;

